{
  "name": "Ядерный реактор",
  "category": "modern_industrialization:midgame",
  "icon": "modern_industrialization:uranium_fuel_rod_quad",
  "pages": [
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/nuclear_reactor_asbl",
      "text": "Ядерный реактор - это большой мультиблок, предназначенный для выработки огромного количества энергии за счет потребления ядерного топлива."
    },
    {
      "type": "text",
      "text": "Он может производить в 100 раз больше EU/t чем дизельное топливо. Он бывает разных размеров от маленького до большого.$(br2)То, как это работает под капотом, может быть немного ошеломляющим, даже несмотря на то, что на следующих страницах это пытаются объяснить."
    },
    {
      "type": "text",
      "text": "Тем не менее, вам не нужно разбираться в деталях, чтобы спроектировать мощный реактор.$(br2)Мы рекомендуем вам поэкспериментировать с различными дизайнами в творческом режиме, пока вы не найдете тот, который вам подходит."
    },
    {
      "type": "text",
      "text": "Обратите внимание, что ядерный реактор не может взорваться, испускать радиацию или иным образом повредить карту. Единственное, что он может повредить, - это предметы, которые вы кладете в него, если температура становится слишком высокой (подробнее об этом позже).$(br2)Вы можете свободно экспериментировать и наслаждаться новой жизнью ученого-ядерщика!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/casing/nuclear_casing_asbl",
      "text": "Основным компонентом является Ядерный Корпус, который изготовлен из ядерного сплава: смеси кадмия, бериллия и взрывоустойчивого сплава."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/casing/nuclear_item_hatch_asbl",
      "text": "Верхнюю часть конструкции составляют люки для ядерных предметов или жидкости (или простые корпуса). Это входы и выходы реактора."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/casing/nuclear_fluid_hatch_asbl",
      "text": "Каждый люк имеет один вход (элемент или жидкость) и два выхода. Входные слоты образуют сетку, отображаемую в графическом интерфейсе реактора (доступном по щелчку правой кнопкой мыши на контроллере)."
    },
    {
      "type": "text",
      "text": "Каждый люк имеет температуру и накапливает тепло, которое можно отвести несколькими способами.$(br)Тепло естественным образом переместится к соседнему люку или наружу, если люк находится на краю - тогда тепло теряется.$(br)Скорость этого процесса равна коэффициенту теплопередачи содержимого люка (показанному в REI), умноженному на разницу температур."
    },
    {
      "type": "text",
      "text": "Тепло также можно отводить в жидкостном люке, производя пар.$(br2)$(l)Температура выше максимальной температуры предмета приведет к его разрушению!$()"
    },
    {
      "type": "text",
      "text": "Элементами активной зоны ядерного реактора являются нейтроны.$(br)Они производятся с помощью ядерного топлива.$(br2)Есть два типа нейтронов:$(li)быстрые;$(li)тепловые.$(br)Быстрые переносят энергию, а тепловые - нет.$(br)Нейтроны движутся по прямой линии, пока не встретят элемент или не выйдут из реактора (для быстрых нейтронов их энергия затем теряется)."
    },
    {
      "type": "text",
      "text": "Поток нейтронов отображается в графическом интерфейсе реактора.$(br2)Когда нейтрон встречает непустой люк, могут произойти две вещи: нейтрон поглощается или рассеивается.$(br)Рассеянный нейтрон случайным образом изменит направление.$(br2)Если рассеянный нейтрон быстрый, он может замедлиться, превратившись в тепловой."
    },
    {
      "type": "text",
      "text": "Все это приводит к передачи энергии от нейтрона к люку в виде тепла.$(br2)Поглощенный нейтрон останавливает своё движение и также передает свою энергию, как если бы это был быстрый нейтрон."
    },
    {
      "type": "text",
      "text" : "Количество поглощенных нейтронов на один люк можно увидеть в графическом интерфейсе пользователя.$(br2)Вероятность для каждого процесса показана в REI.$(br)Она будет сильно зависеть от содержимого люка и типа нейтронов (быстрые или тепловые).$(br2)Ядерное топливо намного лучше поглощает тепловые нейтроны."
    },
    {
      "type": "text",
      "text": "Когда нейтрон, быстрый или тепловой, поглощается ядерным топливом, генерируется больше нейтронов.$(br2)$(o)Это всегда быстрые нейтроны со случайным направлением.$()$(br2)Их генерация сопровождается прямым выделением энергии в виде дополнительного тепла в люке."
    },
    {
      "type": "text",
      "text": "Выше определенного порога количество генерируемых нейтронов будет уменьшаться с температурой до нуля.$(br)Этот процесс расходует немного энергии, но гарантирует стабильность реактора.$(br2)Количество генерируемых нейтронов (и эффективный КПД), прямая энергия и температурный порог указаны в REI."
    },
    {
      "type": "text",
      "text": "Каждый ядерный компонент имеет максимальное количество поглощений. При достижении предмет либо уничтожается, либо превращается в истощенную версию.$(br)Это особенно полезно для ядерного топлива, потому что некоторая часть U-238 превращается в плутоний в обедненной версии, что означает, что некоторая его часть может быть преобразована обратно в топливо."
    },
    {
      "type": "text",
      "text": "То же самое происходит с жидкостями: немного жидкости трансформируется после каждого поглощения нейтронов. Это может быть использовано для массового производства полезных изотопов, таких как дейтерий и тритий.$(br)В обоих случаях результат отображается в REI."
    }
  ],
  "sortnum": 206
}