{
  "name": "Electric Machines",
  "category": "modern_industrialization:electric_age",
  "icon": "modern_industrialization:assembler",
  "pages": [
    {
      "type": "text",
      "text": "Electric machines work exactly the same as steam machines, except that they require electricity instead of steam and they progressively overclock recipes up to 32 EU/t.$(br2)You can use REI to view the recipes for the electric version of the machines you are already familiar with."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:lubricant_bucket",
      "text": "Lubricant is a fluid that can be obtained by mixing creosote and redstone. Right-click an electric machine with a lubricant container such as a lubricant bucket to overclock it manually.$(br2)Each 25 mb of lubricant will add 1 (overclocking) efficiency tick to the machine."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/configurable_chest_asbl",
      "text": "The Configurable Chest is not a machine, but once you have Analog Circuits, you can craft it!$(br2)It has 27 configurable slots, and auto-eject functionality! Very useful for automation!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/polarizer_asbl",
      "text": "The Polarizer polarizes stuff. It doesn't have many recipes yet, but it is already useful to automate Motors!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/assembler_asbl",
      "text": "The first machine you'll want to make a lot of! The Assembler allows you to automate almost all recipes, up to 3 per Assembler if you use slot locking."
    },
    {
      "type": "text",
      "text": "We strongly suggest that you automate Machine Hull, Analog Circuits, Motors, Pistons, Robot Arms and Conveyor Belts using Assemblers as soon as possible, that will make crafting electric machines basically free!"
    },
    {
      "type": "spotlight",
      "title": "Redstone Control Modules",
      "item": "modern_industrialization:redstone_control_module",
      "text": "A Redstone Control Module can be used to control the behavior of electric machines and multiblocks with redstone signals.$(br2)Configure the module in your hand, then insert it into the machine or multiblock controller."
    },
    {
      "type": "spotlight",
      "title": "Overclock Upgrades",
      "item": "modern_industrialization:basic_upgrade",
      "text": "Regular electric machines have an overclock capped at 32 EU/t, and electric multiblocks have an overclock capped at 128 EU/t.$(br2)In the machine or multiblock's menu, add upgades to increase its maximum overclock! Check REI for the exact amounts."
    }
  ],
  "sortnum": 105
}
