{
  "name": "Усовершенствованные станки",
  "category": "modern_industrialization:electric_age",
  "icon": "modern_industrialization:advanced_machine_hull",
  "pages": [
    {
      "type": "spotlight",
      "title": "Алюминий",
      "item": "modern_industrialization:aluminum_ingot",
      "text": "Алюминий — это материал, используемый для изготовления более усовершенствованных станков. Как и другие электрические станки, эти новые станки присоединяются только к низковольтным кабелям. Положи бокситовый порошок в Электрическую доменную печь, и ты получишь кусочки алюминия."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/centrifuge_asbl",
      "text": "Центрифуга разделяет предметы, вращая их очень быстро. Ты можешь его использовать, чтобы делать Углеродный порошок и открыть подходящие рецепты для стали и кремния."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/chemical_reactor_asbl",
      "text": "Химический реактор может делать предметы и вызывать химическую реакцию жидкостей."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/distillery_asbl",
      "text": "Перегонная установка превратит различные жидкости в их облегчённые составляющие. Это будет весьма полезно для Нефтепереработки."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/electrolyzer_asbl",
      "text": "Электролизёр может разделить материалы в их другие составляющие при помощи сильного электротока. Ты можешь электролизовать бокситовый порошок, чтобы получить алюминиевый порошок, который, в свою очередь, ты сможешь напрямую переплавить в алюминиевые слитки в ЭДП."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/configurable_tank_asbl",
      "text": "Настраиваемый бак — это жидкостный аналог Настраиваемого сундука.$(br2)Он имеет 9 настраиваемых слотов, который каждый может хранить 16 вёдер и ещё функциональные возможности автоизвлечения! Полезный для автоматизации с множество различных жидкостей!"
    }
  ],
  "sortnum": 106
}