{
  "name": "Электрические станки",
  "category": "modern_industrialization:electric_age",
  "icon": "modern_industrialization:assembler",
  "pages": [
    {
      "type": "text",
      "text": "Электрические станки работают точно также как и паровые станки, если не считать того, что они требуют электричество вместо пара и они по нарастающей разгоняют рецепты до 32 ЭЕ/такт.$(br2)Ты можешь использовать REI, чтобы просмотреть рецепты для электрических версий станков с которыми ты уже хорошо знаком."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:lubricant_bucket",
      "text": "Смазочное средство — это жидкость, которая может быть получена путём смешивания креозота и редстоуна. ПКМ по электрическому станку при помощи бака для смазочного материала, например, Ведро смазочного материала, чтобы разогнать его вручную.$(br2)Каждое 25 мв смазочного материала добавит 1 (разгон) тактовой продуктивности станку."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/configurable_chest_asbl",
      "text": "Настраиваемый сундук — это не станок, но как только ты поимеешь Аналоговую микросхему, ты сможешь создать его!$(br2)У него есть 27 настраиваемых слотов и функциональные возможности автоизвлечения! Весьма полезный для автоматизации!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/polarizer_asbl",
      "text": "Поляризатор раскалывает вещи. Он до сих пор не имеет большое количество рецептов, но он всё равно полезный для автоматизации Моторов!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/assembler_asbl",
      "text": "Первый станок, который тебе следует сделать дофига! Сборочномонтажная установка позволяет тебе автоматизировать практически все рецепты не более 3х за единицу Сборочномонтажной установки, если ты используешь блокировку слота."
    },
    {
      "type": "text",
      "text": "Мы убедительно указываем на то, чтобы ты автоматизировал Станочный корпус, Аналоговую микросхему, Моторы, Поршни, Роботизированные руки и Конвейеры, используя Сборочномонтажные установки. Чем раньше, тем лучше. Это сделает создание электрических станков по большому счёту даром!"
    }
  ],
  "sortnum": 104
}