{
  "name": "Электричество",
  "category": "modern_industrialization:electric_age",
  "icon": "modern_industrialization:lv_steam_turbine",
  "pages": [
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/steam_turbine_asbl",
      "text": "Паровая турбина использует Пар, чтобы производить электричество. Она преобразует каждое мв Пара в 1 ЭЕ до 32 мв преобразованного каждый такт."
    },
    {
      "type": "text",
      "text": "Паровая турбина автоматически посылает электричество в любой станок, соединённый напрямую к её стороне вывода. Она присоединится только к кабелям, размещённым на её стороне вывода. У неё $(thing)Уровень$() низкого напряжения (НН).$(br2)Каждый электрический кабель имеет Уровень, который определяет, сколько ЭЕ/такт она может передать и к каким станкам она может присоединиться. Медь, Серебро и Олово — это Низкое напряжение, Купроникель и Электрум — это Среднее напряжение и т.д..."
    },
    {
      "type": "text",
      "text": "Кабелепроводка имеет ограничения по количеству энергии, которая она выдвигает в сеть: максимально 256 ЭЕ/такт для кабелей низкого напряжения, 1024 ЭЕ/такт для кабелей среднего напряжения и 8192 ЭЕ/такт для кабелей высокого напряжения. Дело в том, что не существует максимального вывода для сети, а поскольку кабели имеют малое внутреннее хранилище, сеть низкого напряжения может предоставить больше, чем 256 ЭЕ/такт за короткий срок.$(br2)Однако следует отметить, что одиночный блок в электрических станках присоединится только к кабелям низкого напряжения!"
    },
    {
      "type": "text",
      "text": "Чтобы передать больше энергии, тебе нужно либо создать несколько трубопроводов, либо использовать Трансформаторы. Как и следовало ожидать, Трансформаторы X вплоть до Y присоединятся к Y-образным кабелям на его стороне вывода и к X-образным кабелям на его дополнительные 5 сторон."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/transformer/lv_mv/up_asbl",
      "recipe2": "modern_industrialization:electric_age/transformer/lv_mv/down_asbl"
    }
  ],
  "sortnum": 103
}