{
  "name": "Steam Machines",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:bronze_furnace",
  "pages": [
    {
      "type": "text",
      "text": "Now it's time to build some bronze machines. The boiler will automatically produce and send steam to adjacent machines, up to 8 millibuckets per tick.$(br2)Bronze machines can only process recipes up to 2 EU/t, meaning that the recipe will use 2 Energy Units per Tick. As 1 millibucket of steam = 1 EU, a boiler at max temperature can power 4 machines simultaneously!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/compressor_asbl",
      "text": "The Compressor will turn ingots into plates at 1:1 ratio. It can also turn each double ingot into 2 plates. This is probably the first machine you will want to build!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/mixer_asbl",
      "text": "The Mixer will help you mix dusts, giving you a better ratio for bronze, fire clay and later uncooked steel. It can also create cobblestone and clay."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/macerator_asbl",
      "text": "The Macerator will turn 3 crushed dusts/raw ores into 4.5 dusts. Ore hemiquadrupling for the win! It can also recycle all kinds of materials by turning them into dust."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/cutting_machine_asbl",
      "text": "The Cutting Machine will give you better ratios for bolts, gears, rings and rods. It uses a little bit of lubricant every time."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/furnace_asbl",
      "text": "The Furnace is... well... a Furnace. It is as slow as normal Furnaces, but it uses 10 times less fuel because steam is very efficient."
    },
    {
      "type": "text",
      "text": "Steam machines will accept inputs from any side, be it items, steam or another fluid.$(br2)You can lock their slots by clicking on the lock in the interface. Locked slots only accept one type of item or fluid.$(br2)Every machine has an output side, and you can enable auto-eject from the interface. Hoppers, pipes and other automation can extract output items from any side, of course. You can also reduce the maximum number of items in a slot by scrolling."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:tools/wrench",
      "text": "Using a wrench, you can rotate any machine by right-clicking. You can rotate the output side by sneaking while you shift-click.$(br2)Note that breaking a machine with the wrench will not drop it. Use a pickaxe for that!"
    }
  ],
  "sortnum": 3
}