{
  "name": "Upgrading To Steel",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:steel_boiler",
  "pages": [
    {
      "type": "text",
      "text": "Now that you have steel, you can upgrade your bronze machines if you want. Steel machines can process recipes up to 4 EU/t, and they will process recipes at twice the speed as long as the energy usage doesn't go above 4 EU/t. Basically, they are twice as fast as bronze machines and they may also unlock new recipes."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/steel_upgrade_asbl",
      "text":  "To upgrade a bronze machine, craft a Steel Upgrade and apply it in a Crafting Table.$(br2)You can also sneak and right-click a bronze machine with the upgrade to apply it directly."
    },
    {
      "type": "text",
      "text": "Steel hatches have more capacity than bronze hatches, and a multiblock with at least one steel hatch will be upgraded to steel tier. This means that it will go twice as fast if its energy usage wouldn't exceed 4 EU/t.$(br2)A steel boiler will produce twice as much steam as a bronze one, that means up to 16 EU/t, and a steel water pump will produce twice as much water as its bronze counterpart, so up to 2 buckets / 5 seconds."
    },
    {
      "type": "text",
      "text": "Steel tanks store up to 8 buckets.$(br2)You can check all recipes in REI!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/packer_asbl",
      "text": "The Packer, a new machine only available in steel, can perform simple crafts for you. You can now automate double ingots and pipes, for example! Again, check REI."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/unpacker_asbl",
      "text": "The Unpacker, a new machine only available in steel... Guess what it does. o_O"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:trash_can",
      "text": "With a few steel plates, you can now craft a very useful block!$(br2)The Automatic Trash Can will destroy any item or fluid that is piped into it!"
    },
    {
      "type": "text",
      "text": "Additionally, while holding the trash can over a machine's fluid tank, you can click to dump that tank into the trash can directly."
    }
  ],
  "sortnum": 11
}
