{
  "name": "Тебе нравится Кокс?",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:coke_oven",
  "pages": [
    {
      "type": "text",
      "text": "Как только ты поимел достаточно бронзовых станков, ты можешь начать обработку в сторону изготовления стали. Главнейшая цель — это построить многоблок «Карьер», который будет рыть для тебя руды!$(br2)Первый шаг — это сделать кокс путём нагрева угля без кислорода. Для этого тебе понадобится построить многоблок Коксовая печь."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/fireclay/coke_oven",
      "text": "Для такого первого многоблока тебе нужна сама Коксовая печь, несомненно, 21 Кирпича и 3 Шлюза: ввод предмета, вывод предмета и ввод жидкости."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:hatches/bronze/item_input_hatch",
      "recipe2": "modern_industrialization:hatches/bronze/item_output_hatch"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:hatches/bronze/fluid_input_hatch",
      "recipe2": "modern_industrialization:hatches/bronze/fluid_output_hatch"
    },
    {
      "type": "text",
      "text": "Коксовая печь здесь имеет роль $(thing)Регулятора$(). Каждый многоблок управляется за счёт регулятора, но, как правило, тебе нельзя взаимодействовать с регулятором напрямую: каждый ввод и вывод замыкается шлюзами. Нам понадобится ввод жидкости, потому что коксовая печь работает на пару, нам нужен ввод предмета для угля и вывод для кокса.$(br2)Если мы забудем один из шлюзов, коксовая печь не сможет запуститься!"
    },
    {
      "type": "text",
      "text": "$(l)Держи гаечный ключ, чтобы увидеть отсутствующие блоки и ошибки!$() Также ты можешь держать Шлюз, чтобы узнать куда он может подойти.$(br2)Нам нужно 21 Кирпича для этого многоблока! Проверь REI, он в итоге покажет 24, но у нас есть 3 шлюза, так что нам понадобится лишь кирпичи для оставшихся 21 блока!"
    },
    {
      "type": "image",
      "title": "Коксовая печь!",
      "images": [
        "modern_industrialization:textures/guidebook/coke_oven.png"
      ],
      "text": "Существует множество способов поместить шлюзы, это один из них!"
    },
    {
      "type": "text",
      "text": "Как только Коксовая печь показывает $(o)Допустимую форму$(), наполни жидкостный шлюз ввода паром, положи уголь в предметный шлюз ввода и всё тип-топ!$(br2)Кокс будет весьма полезным для стали, но он также является эффективным топливом. Он длится 4 раза как и уголь!"
    }
  ],
  "sortnum": 9
}