{
  "name": "Трубы",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:wrench",
  "pages": [
    {
      "type": "text",
      "text": "Трубы используются в рецептах некоторых машин, но их также можно разместить в мире. В одном блоке может поместиться до 3 труб.$(br2)Трубы разных цветов не будут соединяться.$(br2)Щелчок ПКМ по трубе гаечным ключом изменит тип соединения, щелчок ПКМ с зажатой клавишей Shift приведет к выпадению трубы."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:fluid_pipe",
      "title": "Жидкостные трубы",
      "text": "Жидкостные трубы могут содержать только один тип жидкости, и по умолчанию они не соединяются с пустыми трубами или блоками. Вы можете установить соединение, щелкнув ПКМ в центр трубы с помощью гаечного ключа или щелкнув ПКМ по блоку с трубой в руке: он соединится, но не заберет трубу из инвентаря."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:item_pipe",
      "title": "Предметные трубы",
      "text": "Предметные трубы не будут подключаться к инвентарям по умолчанию, но опять же, вы можете принудительно установить соединение.$(br2)Щелкните ПКМ по соединению без гаечного ключа, и вы увидите фильтр. По умолчанию включен режим белого списка, поэтому предметы не будут вставляться или извлекаться напрямую."
    },
    {
      "type": "text",
      "text": "Различные типы труб работают по-разному.$(br2)Каждый тик, жидкостные трубы будут пытаться равномерно извлекать из всех подключенных блоков, а затем пытаться вставить полученные жидкости равномерно. $(l:modern_industrialization:midgame/fluid_transfer)Подробнее об их скорости здесь.$()"
    },
    {
      "type": "text",
      "text": "Предметные трубы сначала вставляют предметы в тот инвентарь, у которого указан наивысший приоритет. Они будут передавать по 16 предметов каждые несколько секунд.$(br2)$(l)Предметные трубы можно модернизировать с помощью двигателей.$()"
    },
    {
      "type": "text",
      "title": "Примечание",
      "text": "Предметные трубы по умолчанию имеют белый список (что означает, что будут перемещены только элементы, которые указаны в фильтре). Вам нужно включить либо черный список (будут перемещены только элементы, НЕ входящие в фильтр), либо добавить элемент, который вы хотите переместить в белый фильтр, чтобы предметы начали перемещаться."
    },
    {
      "type": "text",
      "title": "Примечание",
      "text": "Имеейте в виду, что вам нужно настроить фильтры на обоих сторонах трубы, иначе предметы не будут перемещаться"
    }
  ],
  "sortnum": 4
}