{
  "name": "Трубы",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:wrench",
  "pages": [
    {
      "type": "text",
      "text": "Трубы используются в рецептах некоторых станков, но они также могут быть размещены в мире. Можно вставить в одиночный блок не более 3х труб.$(br2)Трубы разных цветов не соединятся.$(br2)ПКМ гаечным ключом по трубе изменит тип соединения, shift+ПКМ выкинет трубу."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:fluid_pipe",
      "title": "Жидкостные трубы",
      "text": "Жидкостные трубы могут содержать лишь 1 тип жидкости, и поскольку не избрано иное, они не будут присоединяться к пустым трубам и блокам. Ты можешь присоединить принуждённо путём нажатия ПКМ по центральной части трубы при помощи Гаечного ключа, либо нажав ПКМ по блоку при помощи трубы в руке: она присоединится, но не израсходует предмет в руке."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:item_pipe",
      "title": "Предметные трубы",
      "text": "Предметные трубы не будут присоединятся к инвентарям по умолчанию, но напоминаю, что ты можешь присоединить принуждённо.$(br2)ПКМ по соединению без удержания гаечного ключа, и тогда увидишь фильтр. По умолчанию включен режим белого списка, вследствие чего никакие предметы не будут помещены либо же извлечены напрямую."
    },
    {
      "type": "text",
      "text": "Разные типы труб не работают точно таким же образом.$(br2)С каждым тактом жидкостные трубы будут пытаться поровну извлекать все присоединённые блоки, а затем пытаться вместить поровну. $(l:modern_industrialization:midgame/fluid_transfer)Подробнее о их скорости здесь.$()$(br2)Предметные трубы будут вставлять предметы предпочтительно в трубы с высоким приоритетом, а они перемещают 16 предметов каждые несколько секунд.$(l)Они могут быть улучшены при помощи мотора.$()"
    },
    {
      "type": "text",
      "title": "Примечание",
      "text": "По умолчанию предметные трубы с белым списком (а значит, что лишь предметы в фильтре будут перемещены). Тебе нужно переключиться к чёрному списку (только предметы НЕ в фильтре будут перемещены) либо добавь желаемый предмет, чтобы переместить в фильтр. Следи за тем, что тебе понадобится настроить обе стороны трубы, в противном случае предметы не переместятся."
    }
  ],
  "sortnum": 4
}