{
  "name": "Паровые станки",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:bronze_furnace",
  "pages": [
    {
      "type": "text",
      "text": "Теперь настало время построить несколько бронзовых станков. Котёл будет автоматически производить и посылать пар к смежным станкам, до 8 милливёдер в такт.$(br2)Бронзовые станки могут лишь обрабатывать рецепты до 2 ЭЕ/такт, т.е рецепты будут использовать 2 энергетические единицы в Такт. Учитывая тот факт, что 1 милливедро пара = 1 ЭЕ, котёл при максимальной температуре может снабжать энергией 4 станка одновременно!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/compressor_asbl",
      "text": "Компрессор преобразует слитки в пластины в пропорции 1:1. А ещё он может преобразовать каждый двойной слиток в 2 пластины. Видимо это первый станок, который тебе нужно построить!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/mixer_asbl",
      "text": "Смешивающий станок поможет тебе смешать порошки, дающая тебе подходящее пропорции для бронзы, 	огнеупорной глины и дополнительно сырой стали. Он может ещё и создать булыжник и глину."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/macerator_asbl",
      "text": "Измельчитель преобразует измельчённые порошки/рудные руды в 4.5 порошка. Получетверение руды решает! Он ещё и может переработать всяческие материалы, превращая их в порошок."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/cutting_machine_asbl",
      "text": "Металлорежущий станок даст тебе подходящие пропорции для болтов, шестерён, колец и стержней. Он использует немного смазки в каждом случае."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/furnace_asbl",
      "text": "Печь это... ну... Печь. Она медленная, как обычные Печи, но использует на 10 раз меньше топлива, поскольку пар очень эффективен."
    },
    {
      "type": "text",
      "text": "Паровые станки принимают ресурсы с любой стороны, будь то предметы, пар или очередная жидкость.$(br2)Ты можешь блокировать их слоты путём нажатия по замку в интерфейсе. Заблокированные слоты принимают всего лишь 1 тип предмета или жидкости.$(br2)Каждый станок имеет сторону вывода, и ты можешь задействовать автовывод из интерфейса. Воронки, трубы и прочая автоматизация может извлечь предметы продукции с любой стороны, как тебе это известно. Ты также можешь понизить максимальное количество предметов в слоте путём прокручивания колёсика мыши."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:tools/wrench",
      "text": "Используя гаечный ключ, ты сможешь поворачивать любой станок путём нажатия ПКМ. Ты можешь повернуть сторону вывода путём крадения пока ты нажимаешь shift.$(br2)Прими во внимание, что ломание станка Гаечным ключом не выбросит его. Используй кирку для этого!"
    }
  ],
  "sortnum": 3
}