{
  "name": "Обновление до стали",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:steel_boiler",
  "pages": [
    {
      "type": "text",
      "text": "Теперь, когда у вас есть сталь, вы можете модернизировать свои бронзовые машины, если хотите. Стальные машины могут обрабатывать рецепты до 4 EU/т, и они будут обрабатывать рецепты в два раза быстрее, пока потребление энергии не превышает 4 EU/т. По сути, они в два раза быстрее бронзовых машин, и они также могут открыть новые рецепты."
    },
    {
      "type": "text",
      "text": "Стальные люки имеют большую вместимость, чем бронзовые, а мультиблок с хотя бы одним стальным люком будет повышен до стального уровня. Это означает, что он будет работать в два раза быстрее, если его потребление энергии не превысит 4 EU/т.$(br2)Стальной котёл будет производить вдвое больше пара, чем бронзовый, то есть до 16 EU/т, и стальная помпа будет производить вдвое больше воды, чем её бронзовый аналог, то есть до 2 ведер/5 секунд."
    },
    {
      "type": "text",
      "text": "Стальные баки вмещают до 8 ведер.$(br2)Стальные трубы эквивалентны другим типам труб, но вы можете комбинировать их с другими типами труб в одном блоке, поэтому они могут быть полезны, если вам действительно нужна другая отдельная сеть труб.$(br2)Вы всегда можете проверить все рецепты в REI!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/packer_asbl",
      "text": "Упаковщик, новая машина, доступная только из стали, может выполнять за вас несложную работёнку. Например, теперь вы можете автоматизировать двойные слитки и трубы! Опять же, проверьте REI."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/unpacker_asbl",
      "text": "Распаковщик, новая машина, доступная только из стали... Угадайте, что она делает. о_О"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:trash_can",
      "text": "Теперь с несколькими стальными пластинами, вы можете создать очень полезный блок!$(br2)Автоматический мусорный бак уничтожит любые предмет или жидкость, которые в нее попадают!"
    }
  ],
  "sortnum": 11
}