{
  "name": "Ядерный реактор",
  "category": "modern_industrialization:midgame",
  "icon": "modern_industrialization:uranium_fuel_rod_quad",
  "pages": [
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/nuclear_reactor_asbl",
      "text": "Ядерный реактор — это большой многоблок, который предназначен для генерации огромного количество энергии за счёт потребления ядерного топлива. Он может производить в 100 раз больше ЭЕ/такт, чем дизель-генератор. Он поставляется в нескольких размерах от малого до большого."
    },
    {
      "type": "text",
      "text": "Как он работает с точки зрения внутренней структуры может быть, малость умопомрачительно, несмотря на следующие страницы, пытающиеся это объяснить. Как бы то ни было, тебе не нужно понимать подробности, чтобы придумать мощный реактор.$(br2)Мы рекомендуем экспериментировать с различными вариантами исполнения в творческом режиме до тех пор, пока ты не найдёшь тот, который тебе подойдёт."
    },
    {
      "type": "text",
      "text": "Прими во внимание, что Ядерный реактор не взрывается, излучает радиацию или же в противном случае повреждает карту. Единственное, что он может повредить — это положенные в него предметы, если температура превышает уровень (к вопросу об этом позже).$(br2)Ты не должен стесняться экспериментировать и получать удовольствие от своей новой жизни в качестве физика-ядерщика!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/casing/nuclear_casing_asbl",
      "text": "Основной компонент — это Ядерная обшивка, которая делается из Ядерного сплава : сочетание кадмия, бериллия и жаропрочного сплава."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/casing/nuclear_item_hatch_asbl",
      "text": "Верхняя часть структуры принимает Ядерный предмет или Жидкостные шлюзы (или простые обшивки). Это вводы и выводы реактора."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/casing/nuclear_fluid_hatch_asbl",
      "text": "Каждый шлюз имеет 1 ввод (либо предметный, либо жидкостный) и 2 вывода. Входные слоты сформируют сетку, отображаемую в ГПИ (графический интерфейс) реактора (доступная нажатием ПКМ по регулятору)."
    },
    {
      "type": "text",
      "text": "Каждый шлюз имеет температуру и хранит тепло, которое может быть рассеянно несколькими способами. Тепло естественным образом перемещается к смежному шлюзу или наружу, если шлюз находится на краю, (получается что тепло теряется). Скорость этого процесса равна коэффициенту теплопередачи содержимого шлюзов (показано в REI) помноженное на температурный перепад. Тепло, в свою очередь, может быть извлечено в жидкостные шлюзы путём производства пара. Температура больше, чем максимальная температура предмета его уничтожит."
    },
    {
      "type": "text",
      "text": "Ядерные компоненты ядра являются нейтронами. Они образовываются при помощи ядерного топлива. Есть 2 вида нейтрона : быстрые и тепловые : быстрые содержат в себе энергию, в то время как тепловые — нет. Нейтроны перемещаются по прямой линии до того, как они столкнутся с компонентом или выйдут из реактора, (по поводу быстрых нейтронов — их энергия в таком случае теряется). Поток нейтронов отображён в ГПИ реактора."
    },
    {
      "type": "text",
      "text": "Когда нейтрон сталкивается в непустом шлюзе, может произойти 2 вещи : нейтрон поглотится или рассеется. Рассеянный нейтрон изменит направление случайным образом. Если рассеянный нейтрон быстрый, есть шанс его замедления, становясь тепловым. Это передаёт энергию из нейтрона в шлюз в виде тепла. Поглощённый нейтрон прекращает свой маршрут, а ещё передаёт свою энергию, если был быстрым нейтроном."
    },
    {
      "type": "text",
      "text" : "Число поглощённых нейтронов в одном шлюзе можно увидеть в ГПИ. Вероятность для каждых процессов показана в REI. Они во многом зависят от содержимого шлюза и типа нейтрона (быстрого или теплового). Ядерные топлива намного лучше поглощают тепловые нейтроны."
    },
    {
      "type": "text",
      "text": "Когда нейтрон либо быстрый, либо тепловой поглощается в ядерном топливе, то генерируется больше нейтронов. Эти нейтроны всегда быстрые и имеют случайное направление. Их генерация сопровождается прямым выделением энергии в виде дополнительного тепла в шлюзе."
    },
    {
      "type": "text",
      "text": "Число генерируемых нейтронов уменьшится с температурой выше определенного порога до достижения нуля. Этот процесс теряет некоторое количество энергии, но гарантирует стабильность реактора. Число генерируемых нейтронов (и эффективный к.п.д.), прямая энергия и температурный порог находятся в REI."
    },
    {
      "type": "text",
      "text": "Каждый ядерный компонент имеет максимальное число поглощения. Когда достигнуто, предмет либо уничтожится, либо превратится в обеднённую версию. Это в особой степени полезно для ядерного топлива, поскольку отчасти низкообогащённый уран-238 превращается в обеднённую версию Плутония, а значит, некоторая одна из его частей может быть превращена обратно в топливо."
    },
    {
      "type": "text",
      "text": "То же самое происходит с жидкостями: после каждого поглощения нейтрона преобразуется немного жидкости. Это может быть использовано для массового производства полезных изотопов, таких как дейтерий и тритий. И в 1-ом и во 2-ом случае исход отображён в REI."
    }
  ],
  "sortnum": 206
}