{
  "name": "Buharlı Makineler",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:bronze_furnace",
  "pages": [
    {
      "type": "text",
      "text": "Şimdi sıra bazı bronz makineler inşa etmeye geldi. Kazan otomatik olarak buhar üretecek ve bitişik makinelere gönderecek, tik başına 8 mili kova'ya kadar.$(br2)Bronz makineler yalnızca 2 EU/t'ye kadar olan tarifleri işleyebilir, bu da tarifin Tik başına 2 Energy Unit kullanacağı anlamına gelir. 1 mili kova buhar = 1 EU olduğundan, maks sıcaklıktaki bir kazan aynı anda 4 makineye güç sağlayabilir!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/compressor_asbl",
      "text": "Kompresör külçeleri 1:1 oranında levhalara dönüştürecektir. Ayrıca her bir çift külçeyi 2 levhaya dönüştürebilir. Bu muhtemelen inşa etmek isteyeceğiniz ilk makinedir!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/mixer_asbl",
      "text": "Karıştırıcı tozları karıştırmanıza yardımcı olarak bronz, ateş kili ve daha sonra pişmemiş çelik için daha iyi bir oran sağlar. Ayrıca kırık taş ve kil de oluşturabilir."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/macerator_asbl",
      "text": "Öğütücü 3 ezilmiş tozu/ham cevheri 4.5 toza dönüştürecektir. Kazanmak için cevherleri yarımdörtlükatlama! Ayrıca her türlü malzemeyi toza dönüştürerek geri dönüştürebilir."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/cutting_machine_asbl",
      "text": "Kesme Makinesi size cıvatalar, dişliler, halkalar ve çubuklar için daha iyi oranlar verecektir. Her seferinde biraz yağlayıcı kullanır."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/bronze/furnace_asbl",
      "text": "Ocak... şey... bir ocak. Normal Ocaklar kadar yavaştır, ancak buhar çok verimli olduğu için 10 kat daha az yakıt kullanır."
    },
    {
      "type": "text",
      "text": "Buhar makineleri, eşya, buhar veya başka bir sıvı olsun, herhangi bir taraftan gelen girdileri kabul edecektir.$(br2)Arayüzdeki kilide tıklayarak yuvalarını kilitleyebilirsiniz. Kilitli yuvalar yalnızca bir tür eşya veya sıvı kabul eder.$(br2)Her makinenin bir çıkış tarafı vardır ve arayüzden otomatik çıkartmayı etkinleştirebilirsiniz. Huniler, borular ve diğer otomasyonlar elbette herhangi bir taraftan çıktı eşyaları çıkarabilir. Ayrıca bir yuvadaki maksimum eşya sayısını kaydırarak azaltabilirsiniz."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:tools/wrench",
      "text": "Anahtar kullanarak, herhangi bir makineyi sağ tıklayarak döndürebilirsiniz. Eğilirken Shift tuşuna basarak çıkış tarafını döndürebilirsiniz.$(br2)Anahtarla bir makineyi kırmanın onu düşürmeyeceğini unutmayın. Bunun için bir kazma kullanın!"
    }
  ],
  "sortnum": 3
}