{
  "name": "Çeliğe Yükseltme",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:steel_boiler",
  "pages": [
    {
      "type": "text",
      "text": "Artık çeliğe sahip olduğunuza göre, isterseniz bronz makinelerinizi yükseltebilirsiniz. Çelik makineler 4 EU/t'ye kadar tarifleri işleyebilir ve enerji kullanımı 4 EU/t'nin üzerine çıkmadığı sürece tarifleri iki kat daha hızlı işlerler. Temel olarak, bronz makinelerden iki kat daha hızlıdırlar ve ayrıca yeni tariflerin kilidini açabilirler."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/steel_upgrade_asbl",
      "text":  "Bronz bir makineyi yükseltmek için, bir Çelik Yükseltmesi üretin ve bunu bir Çalışma Masasında uygulayın.$(br2)Bir bronz makineye yükseltme ile eğilip sağ tıklayarak da direkt olarak uygulayabilirsiniz."
    },
    {
      "type": "text",
      "text": "Çelik kapaklar bronz kapaklardan daha fazla kapasiteye sahiptir ve en az bir çelik kapağı olan bir çoklu blok çelik kademesine yükseltilecektir. Bu, enerji kullanımı 4 EU/t'yi aşmazsa iki kat daha hızlı gideceği anlamına gelir.$(br2)Çelik bir kazan bronz bir kazana göre iki kat daha fazla buhar üretecektir, yani 16 EU/t'ye kadar ve çelik bir su pompası bronz muadiline göre iki kat daha fazla su üretecektir, yani 2 kova / 5 saniyeye kadar."
    },
    {
      "type": "text",
      "text": "Çelik tanklar 16 kovaya kadar depolar.$(br2)REI'deki tüm tarifleri kontrol edebilirsiniz!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/packer_asbl",
      "text": "Sadece çelikte mevcut olan yeni bir makine olan Paketleyici, sizin için basit el işleri yapabilir. Örneğin artık çift külçe ve boruları otomatikleştirebilirsiniz! Tekrar, REI'yi kontrol edin."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:steam_age/steel/unpacker_asbl",
      "text": "Paket Açıcı, sadece çelikten üretilen yeni bir makine... Tahmin et ne yapıyor. o_O"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:trash_can",
      "text": "Birkaç çelik levha ile artık çok kullanışlı bir blok üretebilirsiniz!$(br2)Otomatik Çöp Kovası, içine konulan herhangi bir eşyayı veya sıvıyı yok edecektir!"
    },
    {
      "type": "text",
      "text": "Ayrıca, çöp kovasını bir makinenin sıvı deposunun üzerinde tutarken, o depoyu doğrudan çöp kovasına boşaltmak için tıklayabilirsiniz."
    }
  ],
  "sortnum": 11
}
