{
  "name": "Pipes",
  "category": "modern_industrialization:steam_age",
  "icon": "modern_industrialization:wrench",
  "pages": [
    {
      "type": "text",
      "text": "Pipes are used in the recipes of some machines, but they can also be placed in the world. Up to 3 pipes can fit in a single block.$(br2)Pipes of different colors will not connect.$(br2)Right-clicking a pipe with a wrench will change the connection type, shift-right-clicking will drop the pipe."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:fluid_pipe",
      "title": "Fluid Pipes",
      "text": "Fluid pipes can only contain one type of fluid, and by default they won't connect to empty pipes or blocks. You can force a connection by right-clicking the center of the pipe with the wrench, or by right-clicking a block with a pipe in your hand: it will connect, but not consume the item in your hand."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:item_pipe",
      "title": "Item Pipes",
      "text": "Item pipes will not connect to inventories by default, but again you can force a connection.$(br2)Right-click a connection without holding a wrench and will see a filter. By default, whitelist mode is enabled, so no items will be inserted or extracted directly."
    },
    {
      "type": "text",
      "text": "The different types of pipes don't work exactly the same way.$(br2)Every tick, fluid pipes will try to evenly extract for all connected blocks, and then try to insert that evenly. $(l:modern_industrialization:midgame/fluid_transfer)Read more about their speed here.$()$(br2)Item pipes will insert items into higher priorities first, and they will transfer 16 items every few seconds. $(l)They can be upgraded with motors.$()"
    },
    {
      "type": "text",
      "title": "Note",
      "text": "The item pipes are on whitelist by default (which mean only the items in the filter will be moved). You need to switch to blacklist (only the items NOT in the filter will be moved) or add the item you want to move to the filter. Be careful that you need to configure both sides of the pipe, otherwise items will not move."
    }
  ],
  "sortnum": 4
}