{
  "name": "Gelişmiş Makineler",
  "category": "modern_industrialization:electric_age",
  "icon": "modern_industrialization:advanced_machine_hull",
  "pages": [
    {
      "type": "spotlight",
      "title": "Alüminyum",
      "item": "modern_industrialization:aluminum_ingot",
      "text": "Alüminyum, daha gelişmiş makineler yapmak için kullanılan bir malzemedir. Diğer elektrikli makineler gibi, bu yeni makineler de yalnızca AG kablolarına bağlanacaktır. Boksit tozunu bir Elektrikli Maden Eritme Ocağı'na koyun ve alüminyum parçaları elde edin."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/centrifuge_asbl",
      "text": "Santrifüj, nesneleri çok hızlı döndürerek ayırır. Karbon tozu yapmak ve çelik ve silikon için daha iyi tariflerin kilidini açmak için kullanabilirsiniz."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/chemical_reactor_asbl",
      "text": "Kimyasal Reaktör maddelerin ve sıvıların reaksiyona girmesini sağlayabilir."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/distillery_asbl",
      "text": "Damıtma Tesisi çeşitli sıvıları daha hafif parçalarına dönüştürecektir. Bu, Petrol İşleme için çok faydalı olacaktır."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/electrolyzer_asbl",
      "text": "Elektrolizör, güçlü elektrik akımları kullanarak malzemeleri farklı parçalarına ayırabilir. Alüminyum tozu elde etmek için boksit tozunu elektrolize edebilir ve daha sonra EMEO'da doğrudan alüminyum külçelere eritebilirsiniz."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/configurable_tank_asbl",
      "text": "Yapılandırılabilir Tank, Yapılandırılabilir Sandık'ın akışkan eşdeğeridir. 16 kova alabilen 9 yapılandırılabilir yuvası ve otomatik çıkartma işlevi vardır! Birçok farklı sıvı ile otomasyon için kullanışlıdır!"
    }
  ],
  "sortnum": 107
}