{
  "name": "Elektrikli Makineler",
  "category": "modern_industrialization:electric_age",
  "icon": "modern_industrialization:assembler",
  "pages": [
    {
      "type": "text",
      "text": "Elektrikli makineler, buhar yerine elektrik gerektirmeleri ve 32 EU/t'ye kadar aşamalı olarak hız aşırtma yapmaları dışında buharlı makinelerle tamamen aynı şekilde çalışır.$(br2)Zaten aşina olduğunuz makinelerin elektrikli versiyonlarının tariflerini görüntülemek için REI'yi kullanabilirsiniz."
    },
    {
      "type": "spotlight",
      "item": "modern_industrialization:lubricant_bucket",
      "text": "Yağlayıcı, kreozot ve redstone karıştırılarak elde edilebilen bir sıvıdır. Manuel olarak hız aşırtmak için yağlayıcı kovası gibi bir yağlayıcı konteyneri olan bir elektrikli makineye sağ tıklayın.$(br2)Her 25 mb yağlayıcı, makineye 1 (hız aşırtma) verimlilik tik'i ekleyecektir."
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/configurable_chest_asbl",
      "text": "Yapılandırılabilir Sandık bir makine değildir, ancak Analog Devrelere sahip olduğunuzda onu üretebilirsiniz! 27 yapılandırılabilir yuvası ve otomatik çıkartma işlevi vardır! Otomasyon için çok kullanışlıdır!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/polarizer_asbl",
      "text": "Polarizör bir şeyleri polarize eder. Henüz çok fazla tarifi yok, ancak Motorları otomatikleştirmek için zaten kullanışlı!"
    },
    {
      "type": "crafting",
      "recipe": "modern_industrialization:electric_age/machine/assembler_asbl",
      "text": "Çok sayıda yapmak isteyeceğiniz ilk makine! Birleştirici, yuva kilitleme kullanırsanız, Birleştirici başına 3'e kadar neredeyse tüm tarifleri otomatikleştirmenize olanak tanır."
    },
    {
      "type": "text",
      "text": "Makine Gövdesi, Analog Devreler, Motorlar, Pistonlar, Robot Kolları ve Konveyör Bantlarını mümkün olan en kısa sürede Birleştiriciler kullanarak otomatikleştirmenizi şiddetle tavsiye ediyoruz, bu da elektrikli makineler üretmeyi temelde ücretsiz hale getirecektir!"
    },
    {
      "type": "spotlight",
      "title": "Redstone Kontrol Modülleri",
      "item": "modern_industrialization:redstone_control_module",
      "text": "Redstone Kontrol Modülü, redstone sinyalleri ile elektrikli makinelerin ve çoklu blokların davranışını kontrol etmek için kullanılabilir.$(br2)Modülü elinizde yapılandırın, ardından makineye veya çoklu blok denetleyicisine takın."
    },
    {
      "type": "spotlight",
      "title": "Hız Aşırtma Yükseltmeleri",
      "item": "modern_industrialization:basic_upgrade",
      "text": "Normal elektrikli makinelerde hız aşırtma 32 EU/t ile sınırlandırılmıştır ve elektrikli çoklu bloklarda hız aşırtma 128 EU/t ile sınırlandırılmıştır.$(br2)Makine veya çoklu blok menüsünde, maksimum hız aşırtmayı artırmak için yükseltmeler ekleyin! Kesin miktarlar için REI'yi kontrol edin."
    }
  ],
  "sortnum": 105
}
